python_기본문법

*divmode() - 내장함수 목과 나머지를 출력함
int(num,base) - 진법 변환을 지원함 num이 str형일때만 가능

List, tuple, dictionary
- li = []  <- List
- tu= () <- Tuple
- dict = {} <- Dictionary

--List--
import random 
random.choice(student) // 랜덤으로 뽑는다. (list에 있는거)

.append() <- 뒷자리에 추가시킨다

--Tuple--
튜플은 변경된 값을 저장시킬수 없다(값을 바꿀수 없다)

--Dictionary--
{key1:value1....}
dict[key] = value 출력됨
물론 수정도 가능함

자료형변환
int(vari) - 정수형
str(vari) - 문자형
list(vari) - 리스트형으로 한개씩 출력

주석(comment) #
# 설명을 넣을때
# 다른 사람이 보기 쉽게
# 훗날 내가 보기 쉽게



문자열 (string)
"asd" / 'asd' 이런식으로 저장가능

str_1 = """ ㅁㄴㅇ ㅁㅇㄴㅁ
ㅁㄴㅇㅁㄴㅇ ㅁㄴㅇㅁㄴㅇ
ㅁㄴㅇㅁㄴㅇ"""  <<- 여러줄을 출력한다.(줄바꿈)


문자열 Formatting
%d / %f / %s
%s <- 문자열
%d <- 정수형
%f <- 실수형
----c언어스러운

'{ }'.format('abc') << abc가 { }안에 들어간다.
----python스러운

문자열 인덱싱
index를 이용해 각 문자에 접근할 수 있음
위치는 0부터 시작함 / 공백도 포함됨
음수로도 할 수 있다. 마지막부터 -1부터 쭈욱

문자열 슬라이싱
문자열에서 여러값을 한꺼번에 잘라온다.
: 을 이용해 여러값을 한꺼번에 가져올 수 있다.
기존의 문자열을 두고 그대로 복사해 온다.
ex> PYTHON --> [1:4] >> YTH 만 출력
[1부터: 4전까지]
[:3]>>앞에 숫자가 없으면 맨 앞부터 뒤 숫자 까지
[2:]>>2숫자부터 뒤끝까지


문자열 메서드
메서드란? string이라는 자료형이 가지고 있는 함수
string.split() >> 문자열을 공백 단위로 잘라준다.
'안녕하세요 코딩입니다.'
[안녕하세요, 코딩입니다.] >> 이런식으로 잘라준다.

Docstring 
문서화 문자열이다.
함수가 어떤 일을 수행하는지 설명한다.
보통 큰따옴표 """ ㅁㄴㅇ"""세개를 사용한다.
#주석이랑 같은 의미로도 사용한다.


end, 이스케이프 코드
end: print() 함수에서 출력의 끝을 지정한다.*****
파이썬에서는 줄 바꿈이 기본 값이다.
Escape code?
\n, \t 등이 있다.
\n 은 줄바꿈
\t 는 탭과 같은 성질이 있다.
원래는 한문장에 한문장만 쓰는데 연속으로 쓰려면 ;을 쓰므로 인해 연속해서 나아갈 수 있다.

